# Agrupar: Dividir, Combinar e Aplicar
(Groupby : Split, Apply e Combine)
---------------
   O Groupby é uma das operações importantes na análise de dados. Inclui três etapas - <br>
         
   <ul>
    <li><b>Splitting</b></li>
    <li><b>Applying</b>
        <ul>
            <li>Aggregation</li>
            <li>Transformation</li>
            <li>Filterting</li>
        </ul>
    </li>
    <li><b>Combine</b></li>
   </ul>
        
   A propriedade Groupby agrupa os dados de acordo com a coluna fornecida à função.No exemplo a seguir pode ver um agrupamento com o dataframe df.

In [2]:
import pandas as pd
import numpy as np

In [3]:
d={
    'team':["India","New zealand","Australia","India",
            "India","New zealand","Australia","India",
            "New zealand","Australia","New zealand","Australia"],
     'Run':[330,230,300,180,200,250,190,400,340,290,390,333],
     "Match":[2,4,2,1,5,6,3,2,5,3,1,1],
     "Year":['2012','2012','2012','2012','2013','2013','2013','2013','2014','2014','2014','2014']
  }
df=pd.DataFrame(d)
df

           team  Run  Match  Year
0         India  330      2  2012
1   New zealand  230      4  2012
2     Australia  300      2  2012
3         India  180      1  2012
4         India  200      5  2013
5   New zealand  250      6  2013
6     Australia  190      3  2013
7         India  400      2  2013
8   New zealand  340      5  2014
9     Australia  290      3  2014
10  New zealand  390      1  2014
11    Australia  333      1  2014

    A função groupby() retornará um objeto. Podemos imaginar que cada grupo está a apontar para o seu dataframe.

In [5]:
g=df.groupby('team')
g

In [6]:
for team,teamdata in g:
    print(team)
    print("-"*10)
    print(teamdata)
    print("-"*35)

Australia
----------
         team  Run  Match  Year
2   Australia  300      2  2012
6   Australia  190      3  2013
9   Australia  290      3  2014
11  Australia  333      1  2014
-----------------------------------
India
----------
    team  Run  Match  Year
0  India  330      2  2012
3  India  180      1  2012
4  India  200      5  2013
7  India  400      2  2013
-----------------------------------
New zealand
----------
           team  Run  Match  Year
1   New zealand  230      4  2012
5   New zealand  250      6  2013
8   New zealand  340      5  2014
10  New zealand  390      1  2014
-----------------------------------

 **get_group('group name') :**  <br>
    Retornará o dataframe de um grupo específico

In [7]:
g.get_group('India')

    team  Run  Match  Year
0  India  330      2  2012
3  India  180      1  2012
4  India  200      5  2013
7  India  400      2  2013

In [8]:
g.get_group('Australia')

         team  Run  Match  Year
2   Australia  300      2  2012
6   Australia  190      3  2013
9   Australia  290      3  2014
11  Australia  333      1  2014

    Também podemos realizar as operações que estávamos aplicando ao dataframe. A única diferença que obtém é que a operação será aplicada a todos os grupos e retornará o resultado de todos os grupos.

In [9]:
g.min()

             Run  Match  Year
team
Australia    190      1  2012
India        180      1  2012
New zealand  230      1  2012

In [17]:
# Selecione as colunas numéricas primeiro
df_numeric = df.select_dtypes(include='number')

# Agora, aplique o groupby e calcule a média nas colunas numéricas
group_mean = df_numeric.groupby(df['team']).mean()

print(group_mean)

                Run  Match
team
Australia    278.25   2.25
India        277.50   2.50
New zealand  302.50   4.00

In [21]:
g_yr = df.groupby('Year')
g_yr['Run'].agg(['min', 'max', 'mean', 'sum', 'std'])

      min  max    mean   sum        std
Year
2012  180  330  260.00  1040  67.823300
2013  190  400  260.00  1040  96.953597
2014  290  390  338.25  1353  40.974586